"""
Реализовать склонение слова «процент» для чисел до 20.
Например, задаем число 5 — получаем «5 процентов», задаем число 2 — получаем «2 процента».
Вывести все склонения для проверки.
"""

MSG = 'процент'

for i in range(21):
    msg = MSG
    mod_10 = i % 10
    mod_100 = i % 100
    if mod_100 in [11, 12, 13, 14] or mod_10 in [0, 5, 6, 7, 8, 9]:
        msg += 'ов'
    elif mod_10 in [2, 3, 4]:
        msg += 'а'
    print(f'{i} {msg}')
